1.surge/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

canCompile || exit 0    # Dynamic code

restore0Dir

runApplication blockMesh

runApplication topoSet

runApplication subsetMesh -overwrite c0 -patch floatingObject

runApplication setFields


runApplication $(getApplication)
runApplication mpirun -np 32 renumberMesh -overwrite -parallel
runApplication mpirun --oversubscribe -np 64 waveFoam -parallel  >log.waveFoam 
#------------------------------------------------------------------------------
